---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.GetAllCapsStatus
source: html/4d35db5f-70f5-1c08-0fee-a0f8ffd1652b.htm
---
# Autodesk.Revit.DB.FormattedText.GetAllCapsStatus Method

Returns whether All , None or a Mixed of characters in the entire text are in all caps.

## Syntax (C#)
```csharp
public FormatStatus GetAllCapsStatus()
```

## Returns
The format status of all caps on characters FormatStatus .

## Remarks
This function only returns All or None if the entire text contains one character.